USE	Academy

GO

--************************************************************************************************
--1. Вивести номери корпусів, якщо сумарний фонд фінансування розташованих
--у них кафедр перевищує 100 000.

SELECT 
		[D].[Building] AS 'Номер корпусу', 
		SUM([D].[Financing]) AS 'Сумарний фонт фінансування'
FROM 
		[Departments] AS [D]
GROUP BY [D].[Building]
HAVING 
		SUM([D].[Financing]) > 100000

--************************************************************************************************
--2. Вивести назви груп 5-го курсу кафедри “Software Development”,
--які мають понад 10 пар на перший тиждень.

--! запит змінено під існуючу базу (“Software Development” = “РПО”) !--
--! запит змінено під існуючу базу (які мають понад 10 пар на..= які мають >= 1 пар) !--

SELECT 
		[G].[Name] AS 'Назва групи', 
		[Temp].[Кількість лекцій] AS 'Кількість лекцій'
FROM	[Groups] AS [G] JOIN [Departments] AS [D] ON [G].[DepartmentId] = [D].[Id]
		INNER JOIN (SELECT 
						[GL].[GroupId], COUNT([GL].[LectureId]) AS 'Кількість лекцій'
					FROM 
						[GroupsLectures] AS [GL] JOIN [Lectures] AS [L] ON [GL].[LectureId] = [L].[Id]
					WHERE 
						[L].[Date] BETWEEN '2022-09-01' AND '2022-09-07'
					GROUP BY 
						[GL].[GroupId]) AS [Temp] ON [Temp].[GroupId] = [G].[Id]
WHERE 
		[G].[Year] = 5 AND
		[D].[Name] = 'РПО' AND
		[Temp].[Кількість лекцій] >= 1

--************************************************************************************************
--3. Вивести назви груп, які мають рейтинг (середній рейтинг усіх студентів групи)
--більший, ніж рейтинг групи “D221”

--! запит змінено під існуючу базу (групи “D221” = групи “GR11”) !--

SELECT 
		[G].[Name] AS 'Назва групи', 
		AVG([S].[Rating]) AS 'Середній рейтинг'
FROM 
		[GroupsStudents] AS [GS] JOIN [Students] AS [S] ON [GS].[StudentId] = [S].[Id]
		INNER JOIN [Groups] AS [G] ON [G].[Id] = [GS].[GroupId]
GROUP BY [G].[Name]
HAVING 
		AVG([S].[Rating]) > (SELECT 
									AVG([S].[Rating])
						   FROM 
									[GroupsStudents] AS [GS] JOIN [Students] AS [S] ON [GS].[StudentId] = [S].[Id]
									INNER JOIN [Groups] AS [G] ON [G].[Id] = [GS].[GroupId]
                           WHERE 
									[G].[Name] = 'GR11'
                           GROUP BY [G].[Name])

--************************************************************************************************
--4. Вивести прізвища та імена викладачів, ставка яких вища
--за середню ставку професорів.

SELECT 
		[T].[Name] + ' ' + [T].[Surname] AS 'Прізвища та імена викладачів'
FROM 
		[Teachers] AS [T] 
WHERE 
		[T].[Salary] > (SELECT 
								AVG([T].[Salary])
						FROM 
								[Teachers] AS [T] 
					  WHERE 
								[T].[IsProfessor] = 'true')

--************************************************************************************************
--5. Вивести назви груп, які мають більше одного куратора.

SELECT 
		[G].[Name] AS 'Назва груп', 
		COUNT([C].[Name]) AS 'Кількість кураторів'
FROM 
		[Groups] AS [G] JOIN [GroupsCurators] AS [GC] ON [G].[Id] = [GC].[GroupId]
		JOIN [Curators] AS [C] ON [C].[Id] = [GC].[CuratorId]
GROUP BY [G].[Name]
HAVING 
		COUNT([C].[Name]) > 1

--************************************************************************************************
--6. Вивести назви груп, які мають рейтинг (середній рейтинг усіх 
--студентів групи) менший, ніж мінімальний рейтинг груп 5-го курсу.

--! запит змінено під існуючу базу (менший, ніж мінімальний = більше, ніж мінімальний) !--

SELECT 
		[G].[Name] AS 'Назва групи', 
		AVG([S].[Rating]) AS 'Середній рейтинг'
FROM 
		[GroupsStudents] AS [GS] JOIN [Students] AS [S] ON [GS].[StudentId] = [S].[Id]
		INNER JOIN [Groups] AS [G] ON [G].[Id] = [GS].[GroupId]
GROUP BY [G].[Name]
HAVING 
		AVG([S].[Rating]) >		(SELECT 
									MIN([TEMP].[Середній рейтинг]) AS 'Мінімальний рейтинг груп 5 курсу'
								FROM
									(SELECT [G].[Name] AS 'Назва групи', AVG([S].[Rating]) AS 'Середній рейтинг'
									FROM [GroupsStudents] AS [GS] JOIN [Students] AS [S] ON [GS].[StudentId] = [S].[Id]
									INNER JOIN [Groups] AS [G] ON [G].[Id] = [GS].[GroupId]
									 WHERE [G].[Year] = 5
									 GROUP BY [G].[Name]) AS [TEMP])
		   
--************************************************************************************************
--7. Вивести назви факультетів, сумарний фонд фінансуван-
--ня кафедр яких більший за сумарний фонд фінансування
--кафедр факультету “Computer Science”.



--************************************************************************************************
--8. Вивести назви дисциплін та повні імена викладачів, які
--читають найбільшу кількість лекцій з них.



--************************************************************************************************
--9. Вивести назву дисципліни, за якою читається найменше
--лекцій.



--************************************************************************************************
--10. Вивести кількість студентів та дисциплін, що читаються
--на кафедрі “Software Development”.



--************************************************************************************************
